app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 19 Jul 2014 20:50:38 UTC +00:00], ["title", "backbone board"], ["updated_at", Sat, 19 Jul 2014 20:50:38 UTC +00:00]]
---
    def create
      @board = current_user.boards.new(board_params)

      if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "cards".* FROM "cards" WHERE "cards"."list_id" IN (1, 7, 8)
---
    def show
      @board = Board.includes(:members, lists: :cards).find(params[:id])