app/controllers/api/lists_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "lists".* FROM "lists" WHERE "lists"."board_id" = ?  [["board_id", 3]]
---
    def index
      @lists = Board.find(params[:board_id]).lists

INSERT INTO "lists" ("board_id", "created_at", "rank", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["board_id", 3], ["created_at", Sat, 19 Jul 2014 21:31:32 UTC +00:00], ["rank", 4], ["title", "work goddam it"], ["updated_at", Sat, 19 Jul 2014 21:31:32 UTC +00:00]]
---
    def create
      @list = List.new(list_params)
      if @list.save